#Выбор города и отображение его региона и страны

SELECT _cities.title AS 'Город', _regions.title AS 'Регион', _countries.title AS 'Страна'   FROM _cities LEFT JOIN _regions ON _cities.region_id = _regions.id   LEFT JOIN _countries ON _cities.country_id = _countries.id WHERE _cities.title = 'Домодедово';

-- +------------+--------------------+--------+
-- | Город      | Регион             | Страна |
-- +------------+--------------------+--------+
-- | Домодедово | Московская область | Россия |
-- +------------+--------------------+--------+
-- 1 row in set (0.03 sec)


SELECT _cities.title AS 'Город', _regions.title AS 'Регион', _countries.title AS 'Страна'   FROM _cities LEFT JOIN _regions ON _cities.region_id = _regions.id   LEFT JOIN _countries ON _cities.country_id = _countries.id WHERE _cities.title = 'Стародуб';

-- +----------+--------------------+--------+
-- | Город    | Регион             | Страна |
-- +----------+--------------------+--------+
-- | Стародуб | Брянская область   | Россия |
-- | Стародуб | Московская область | Россия |
-- +----------+--------------------+--------+
-- 2 rows in set (0.00 sec)                       


#Вывод всех городов московской области

# 1. Получаем ID региона из таблицы областей

SELECT * FROM _regions WHERE title = 'Московская область';

-- +---------+------------+--------------------+
-- | id      | country_id | title              |
-- +---------+------------+--------------------+
-- | 1053480 |          1 | Московская область |
-- +---------+------------+--------------------+
-- 1 row in set (0.00 sec)

# 2. Выбираем из таблицы городов все названия из записей, у которых ID региона 1053480

SELECT _cities.title AS 'Город' FROM _cities WHERE region_id = 1053480;

-- +------------------------------------------+
-- | Город                                    |
-- +------------------------------------------+
-- | Балашиха                                 |
-- | Видное                                   |
-- | Жуковский                                |
-- | Коломна                                  |
-- | Люберцы                                  |
-- | Орехово-Зуево                            |
-- | Пущино                                   |
-- | Раменское                                |
-- | Сходня                                   |
-- | Химки                                    |
-- | Подольск                                 |
-- | Мытищи                                   |
-- | Серпухов
-- ########
-- ########
-- | Чернышовка                               |
-- | Шевелкино                                |
-- | Юность                                   |
-- | д/о Монино                               |
-- | д/о Соколовский                          |
-- | Остафьево                                |
-- | Малаховка                                |
-- | Снегири                                  |
-- | Токарево                                 |
-- | Серково                                  |
-- | Торбеево                                 |
-- | Поварово                                 |
-- +------------------------------------------+
-- 6653 rows in set (0.01 sec)


-- Также можно одним запросом
SELECT _cities.title AS 'Город', _regions.title FROM _cities LEFT JOIN _regions ON _cities.region_id = _regions.id WHERE _regions.id = '1053480';

-- +------------------------------------------+
-- | Город                                    |
-- +------------------------------------------+
-- | Балашиха                                 |
-- | Видное                                   |
-- | Жуковский                                |
-- ########
-- ########
-- | Токарево                                 |
-- | Серково                                  |
-- | Торбеево                                 |
-- | Поварово                                 |
-- +------------------------------------------+
-- 6653 rows in set (0.01 sec)